---
kind: type
id: T:Autodesk.Revit.DB.ViewScheduleExportOptions
source: html/f0bde7ea-ceab-820d-7c55-b09819f21607.htm
---
# Autodesk.Revit.DB.ViewScheduleExportOptions

The export options used to export schedule views.

## Syntax (C#)
```csharp
public class ViewScheduleExportOptions : IDisposable
```